In [4]:
import pandas as pd

In [1]:
data =[['Adi',30],['Ram',40],['Shyam',35]]

In [2]:
data

[['Adi', 30], ['Ram', 40], ['Shyam', 35]]

In [5]:
pd.DataFrame(data, columns=['Name', 'Marks'])

    Name  Marks
0    Adi     30
1    Ram     40
2  Shyam     35

In [6]:
import numpy as np

In [8]:
arr=np.array([[1,2,3],[4,5,6],[7,8,9]])

In [9]:
df=pd.DataFrame(arr, columns=['A', 'B', 'C'])

In [10]:
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [12]:
df1=pd.read_excel('data.xlsx')

In [13]:
df1

    NAME SCHOOL  MARKS
0    ADI    SAS     25
1  AKASH    DPS     65
2  AYUSH    NPS     25
3   NEEL   DJPS     45
4  SHUBH   SBHS     22
5  NEELA    PPS     66
6  ARYAN    MNS     67

In [ ]:
df=pd.read_json('data.json')#need to do the json file's data as array

In [15]:
df

    name    lang
0    Adi  Python
1  Deban  Python
2  Sayan  Python

In [16]:
df=pd.read_csv("https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv")

In [17]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

EDA= EXPLORATORY DATA ANALYSIS

In [18]:
df.head()#for starting 5 rows

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [20]:
df.tail() # foor ending 5 rows

     total_bill   tip     sex smoker   day    time  size
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

In [21]:
df.info() # to get the information about the dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [22]:
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [23]:
df.columns # to get the columns of the dataframe

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

In [24]:
df.shape # to get the shape of the dataframe

(244, 7)